### RFM 분석 실습
- Recency: 얼마나 최근에 구매했는가
- Frequency: 얼마나 자주 구매했는가
- Monetary: 얼마나 많은 금액을 지출했는가

### 고객 분석
- InvoiceNo: 거래 번호
- StockCode: 상품 코드
- Description: 상품명 
- InvoiceDate: 거래 날짜
- UnitPrice: 상품 단가
- CustomerID: 고객 번호
- Country: 국가명

### 데이터 탐색

In [232]:
import pandas as pd

# csv 데이터 호출
ci_df = pd.read_csv("./datasets/customer_invoice_data.csv")
display(ci_df)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

#### 데이터 정보 확인

In [233]:
# 데이터 정보 확인
ci_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

#### 피처 삭제

In [234]:
# 불필요한 피처 삭제
ci_df = ci_df.drop(labels='Description', axis=1)
ci_df

,InvoiceNo,StockCode,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...
541904,581587,22613,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,3,12/9/2011 12:50,4.95,12680.0,France

#### 데이터 피처명 변경

In [235]:
# 데이터 피처명 변경
ci_df.columns = ['Order_No', 'Product_Code', 'Quantity', 'Order_Date', 'Price', 'Customer_ID', 'Country']

In [236]:
ci_df

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
0,536365,85123A,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...
541904,581587,22613,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,3,12/9/2011 12:50,4.95,12680.0,France

#### 중복행 검사

In [237]:
# 중복행 데이터 개수 확인
ci_df.duplicated().sum()

5270

In [238]:
# 중복행 데이터 확인
ci_df[ci_df.duplicated()]

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
517,536409,21866,1,12/1/2010 11:45,1.25,17908.0,United Kingdom
527,536409,22866,1,12/1/2010 11:45,2.10,17908.0,United Kingdom
537,536409,22900,1,12/1/2010 11:45,2.95,17908.0,United Kingdom
539,536409,22111,1,12/1/2010 11:45,4.95,17908.0,United Kingdom
555,536412,22327,1,12/1/2010 11:49,2.95,17920.0,United Kingdom
...,...,...,...,...,...,...,...
541675,581538,22068,1,12/9/2011 11:34,0.39,14446.0,United Kingdom
541689,581538,23318,1,12/9/2011 11:34,2.49,14446.0,United Kingdom
541692,581538,22992,1,12/9/2011 11:34,1.95,14446.0,United Kingdom
541699,581538,22694,1,12/9/2011 11:34,2.10,14446.0,United Kingdom
541701,581538,23343,1,12/9/2011 11:34,2.08,14446.0,United Kingdom

In [239]:
# 중복행 데이터 삭제
ci_df = ci_df[~ (ci_df.duplicated())]
ci_df

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
0,536365,85123A,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...
541904,581587,22613,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,3,12/9/2011 12:50,4.95,12680.0,France

#### 이상 데이터 확인

In [240]:
# 상품 개수가 음수로 나오는 데이터 확인
ci_df[ci_df['Quantity'] <= 0]

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
141,C536379,D,-1,12/1/2010 9:41,27.50,14527.0,United Kingdom
154,C536383,35004C,-1,12/1/2010 9:49,4.65,15311.0,United Kingdom
235,C536391,22556,-12,12/1/2010 10:24,1.65,17548.0,United Kingdom
236,C536391,21984,-24,12/1/2010 10:24,0.29,17548.0,United Kingdom
237,C536391,21983,-24,12/1/2010 10:24,0.29,17548.0,United Kingdom
...,...,...,...,...,...,...,...
540449,C581490,23144,-11,12/9/2011 9:57,0.83,14397.0,United Kingdom
541541,C581499,M,-1,12/9/2011 10:28,224.69,15498.0,United Kingdom
541715,C581568,21258,-5,12/9/2011 11:57,10.95,15311.0,United Kingdom
541716,C581569,84978,-1,12/9/2011 11:58,1.25,17315.0,United Kingdom
541717,C581569,20979,-5,12/9/2011 11:58,1.25,17315.0,United Kingdom

In [241]:
# 상품 개수가 음수로 나오는 데이터 삭제
ci_df = ci_df[~ (ci_df['Quantity'] <= 0)]
ci_df

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
0,536365,85123A,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...
541904,581587,22613,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,3,12/9/2011 12:50,4.95,12680.0,France

#### 결측치 검사

In [242]:
# 결측치 데이터 개수 확인
ci_df.isna().sum()

Order_No             0
Product_Code         0
Quantity             0
Order_Date           0
Price                0
Customer_ID     133322
Country              0
dtype: int64

In [243]:
# 결측치 데이터 확인
ci_df[ci_df['Customer_ID'].isna()]

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
622,536414,22139,56,12/1/2010 11:52,0.00,NaN,United Kingdom
1443,536544,21773,1,12/1/2010 14:32,2.51,NaN,United Kingdom
1444,536544,21774,2,12/1/2010 14:32,2.51,NaN,United Kingdom
1445,536544,21786,4,12/1/2010 14:32,0.85,NaN,United Kingdom
1446,536544,21787,2,12/1/2010 14:32,1.66,NaN,United Kingdom
...,...,...,...,...,...,...,...
541536,581498,85099B,5,12/9/2011 10:26,4.13,NaN,United Kingdom
541537,581498,85099C,4,12/9/2011 10:26,4.13,NaN,United Kingdom
541538,581498,85150,1,12/9/2011 10:26,4.96,NaN,United Kingdom
541539,581498,85174,1,12/9/2011 10:26,10.79,NaN,United Kingdom
541540,581498,DOT,1,12/9/2011 10:26,1714.17,NaN,United Kingdom

In [244]:
# 결측치 데이터 삭제
ci_df = ci_df[~ (ci_df['Customer_ID'].isna())]
ci_df

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
0,536365,85123A,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...
541904,581587,22613,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,3,12/9/2011 12:50,4.95,12680.0,France

### 데이터 전처리

#### Customer_Id 타입 변환

In [245]:
# Customer_Id 기존 데이터 타입 확인
print(ci_df['Customer_ID'].dtypes)

# 실수에서 정수 타입으로 변환
ci_df = ci_df.astype({'Customer_ID': 'int32'})
# Customer_Id 변경 데이터 타입 확인
print(ci_df['Customer_ID'].dtypes)
ci_df

float64
int32

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
0,536365,85123A,6,12/1/2010 8:26,2.55,17850,United Kingdom
1,536365,71053,6,12/1/2010 8:26,3.39,17850,United Kingdom
2,536365,84406B,8,12/1/2010 8:26,2.75,17850,United Kingdom
3,536365,84029G,6,12/1/2010 8:26,3.39,17850,United Kingdom
4,536365,84029E,6,12/1/2010 8:26,3.39,17850,United Kingdom
...,...,...,...,...,...,...,...
541904,581587,22613,12,12/9/2011 12:50,0.85,12680,France
541905,581587,22899,6,12/9/2011 12:50,2.10,12680,France
541906,581587,23254,4,12/9/2011 12:50,4.15,12680,France
541907,581587,23255,4,12/9/2011 12:50,4.15,12680,France
541908,581587,22138,3,12/9/2011 12:50,4.95,12680,France

#### Order_Date 현재 기준으로 변경

In [246]:
# 날짜 데이터 datetime으로 형식 변환
ci_df['Order_Date'] = pd.to_datetime(ci_df['Order_Date'])

# 날짜 내림차순 정렬
ci_df.sort_values(by=['Order_Date'], ascending = False)

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
541908,581587,22138,3,2011-12-09 12:50:00,4.95,12680,France
541901,581587,22367,8,2011-12-09 12:50:00,1.95,12680,France
541895,581587,22556,12,2011-12-09 12:50:00,1.65,12680,France
541896,581587,22555,12,2011-12-09 12:50:00,1.65,12680,France
541897,581587,22728,4,2011-12-09 12:50:00,3.75,12680,France
...,...,...,...,...,...,...,...
3,536365,84029G,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
1,536365,71053,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
5,536365,22752,2,2010-12-01 08:26:00,7.65,17850,United Kingdom
6,536365,21730,6,2010-12-01 08:26:00,4.25,17850,United Kingdom
0,536365,85123A,6,2010-12-01 08:26:00,2.55,17850,United Kingdom

In [247]:
# 데이터 중 가장 최신 날짜 가져오기
recently_date = pd.to_datetime(ci_df['Order_Date'].max())
print(recently_date)

# 현재 기준으로 변경하기
ci_df['Order_Date'] = (recently_date - pd.to_datetime(ci_df['Order_Date'])).dt.days

# 날짜 오름차순 정렬(최신순)
ci_df.sort_values(by=['Order_Date'], ascending = True)

2011-12-09 12:50:00

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country
541908,581587,22138,3,0,4.95,12680,France
538739,581414,22027,12,0,0.42,14730,United Kingdom
538740,581414,22505,1,0,4.95,14730,United Kingdom
538741,581414,23417,1,0,0.39,14730,United Kingdom
538742,581414,21592,2,0,0.39,14730,United Kingdom
...,...,...,...,...,...,...,...
718,536425,22645,12,373,1.45,13758,United Kingdom
717,536425,22644,12,373,1.45,13758,United Kingdom
716,536425,22646,12,373,1.45,13758,United Kingdom
714,536425,22637,12,373,2.55,13758,United Kingdom
0,536365,85123A,6,373,2.55,17850,United Kingdom

#### 총 구매 금액

In [248]:
# 주문 수량과 상품 단가를 곱하여 총합 구하기
ci_df['total'] = ci_df['Quantity'] * ci_df['Price']
ci_df

,Order_No,Product_Code,Quantity,Order_Date,Price,Customer_ID,Country,total
0,536365,85123A,6,373,2.55,17850,United Kingdom,15.30
1,536365,71053,6,373,3.39,17850,United Kingdom,20.34
2,536365,84406B,8,373,2.75,17850,United Kingdom,22.00
3,536365,84029G,6,373,3.39,17850,United Kingdom,20.34
4,536365,84029E,6,373,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...
541904,581587,22613,12,0,0.85,12680,France,10.20
541905,581587,22899,6,0,2.10,12680,France,12.60
541906,581587,23254,4,0,4.15,12680,France,16.60
541907,581587,23255,4,0,4.15,12680,France,16.60
541908,581587,22138,3,0,4.95,12680,France,14.85

#### Recency

In [249]:
new_df = ci_df.groupby('Customer_ID')['Order_Date'].min().reset_index(name='RecentlyDate')
new_df

      Customer_ID  RecentlyDate
0           12346           325
1           12347             1
2           12348            74
3           12349            18
4           12350           309
...           ...           ...
4334        18280           277
4335        18281           180
4336        18282             7
4337        18283             3
4338        18287            42

[4339 rows x 2 columns]

#### Frequency

In [250]:
new_df['Oder_count'] = ci_df.groupby('Customer_ID')['Order_No'].count().reset_index()['Order_No']
new_df

      Customer_ID  RecentlyDate  Oder_count
0           12346           325           1
1           12347             1         182
2           12348            74          31
3           12349            18          73
4           12350           309          17
...           ...           ...         ...
4334        18280           277          10
4335        18281           180           7
4336        18282             7          12
4337        18283             3         721
4338        18287            42          70

[4339 rows x 3 columns]

#### Monetary

In [251]:
new_df['total_Pirce'] = ci_df.groupby('Customer_ID').sum('total').reset_index()['total']
new_df

      Customer_ID  RecentlyDate  Oder_count  total_Pirce
0           12346           325           1     77183.60
1           12347             1         182      4310.00
2           12348            74          31      1797.24
3           12349            18          73      1757.55
4           12350           309          17       334.40
...           ...           ...         ...          ...
4334        18280           277          10       180.60
4335        18281           180           7        80.82
4336        18282             7          12       178.05
4337        18283             3         721      2045.53
4338        18287            42          70      1837.28

[4339 rows x 4 columns]

In [252]:
new_df.duplicated().sum()

0

### 정규화

In [253]:
from sklearn.preprocessing import MinMaxScaler

# 데이터 프레임 복사
df_copy = new_df.copy()
# Customer_ID 피처 삭제
rfm = df_copy.drop(labels=['Customer_ID'], axis=1)

# 정규화 진행
normalization = MinMaxScaler()
rfm_normalization = normalization.fit_transform(rfm)

In [254]:
# 정규화된 데이터를 데이터 프레임으로 변환, 피처는 rfm과 동일하게 설정
rfm = pd.DataFrame(rfm_normalization, columns=rfm.columns)
rfm

      RecentlyDate  Oder_count  total_Pirce
0         0.871314    0.000000     0.275453
1         0.002681    0.023583     0.015382
2         0.198391    0.003909     0.006414
3         0.048257    0.009381     0.006272
4         0.828418    0.002085     0.001193
...            ...         ...          ...
4334      0.742627    0.001173     0.000645
4335      0.482574    0.000782     0.000288
4336      0.018767    0.001433     0.000635
4337      0.008043    0.093811     0.007300
4338      0.112601    0.008990     0.006557

[4339 rows x 3 columns]

#### 회원 등급

In [255]:
rfm['RecentlyDate'] = 1 - rfm['RecentlyDate']

new_df['TotalScore'] = rfm[['RecentlyDate', 'Oder_count', 'total_Pirce']].sum(axis=1)
new_df

      Customer_ID  RecentlyDate  Oder_count  total_Pirce  TotalScore
0           12346           325           1     77183.60    0.404139
1           12347             1         182      4310.00    1.036284
2           12348            74          31      1797.24    0.811931
3           12349            18          73      1757.55    0.967396
4           12350           309          17       334.40    0.174860
...           ...           ...         ...          ...         ...
4334        18280           277          10       180.60    0.259190
4335        18281           180           7        80.82    0.518496
4336        18282             7          12       178.05    0.983302
4337        18283             3         721      2045.53    1.093068
4338        18287            42          70      1837.28    0.902947

[4339 rows x 5 columns]

In [256]:
import numpy as np

# 회원 등급 책정을 위해 백분위수 계산
# 각 백분위 수는 각 변수에 할당
l1, l2, l3, l4 = np.percentile(new_df['TotalScore'], [15, 40, 75, 95])
print(l1, l2, l3, l4)

0.4224675297500095 0.8209430058823654 0.9733935252136394 1.038661123851847

In [257]:
# 회원의 등급 책정을 위한 함수 선언
def get_level(x):
    if x <= l1:
        return 5
    if x > l1 and x <= l2:
        return 4
    if x > l2 and x <= l3:
        return 3
    if x > l3 and x <= l4:
        return 2
    return 1

In [258]:
# 데이터 프레임에 Level 피처 추가(각 회원 등급 추가)
new_df['Level'] = new_df['TotalScore'].apply(get_level)
new_df

      Customer_ID  RecentlyDate  Oder_count  total_Pirce  TotalScore  Level
0           12346           325           1     77183.60    0.404139      5
1           12347             1         182      4310.00    1.036284      2
2           12348            74          31      1797.24    0.811931      4
3           12349            18          73      1757.55    0.967396      3
4           12350           309          17       334.40    0.174860      5
...           ...           ...         ...          ...         ...    ...
4334        18280           277          10       180.60    0.259190      5
4335        18281           180           7        80.82    0.518496      4
4336        18282             7          12       178.05    0.983302      2
4337        18283             3         721      2045.53    1.093068      1
4338        18287            42          70      1837.28    0.902947      3

[4339 rows x 6 columns]

In [259]:
new_df['Level'] = new_df['Level'].replace([5, 4, 3, 2, 1], ['Bronze', 'Silver', 'Gold', 'Diamond', 'VIP'])
new_df

      Customer_ID  RecentlyDate  Oder_count  total_Pirce  TotalScore    Level
0           12346           325           1     77183.60    0.404139   Bronze
1           12347             1         182      4310.00    1.036284  Diamond
2           12348            74          31      1797.24    0.811931   Silver
3           12349            18          73      1757.55    0.967396     Gold
4           12350           309          17       334.40    0.174860   Bronze
...           ...           ...         ...          ...         ...      ...
4334        18280           277          10       180.60    0.259190   Bronze
4335        18281           180           7        80.82    0.518496   Silver
4336        18282             7          12       178.05    0.983302  Diamond
4337        18283             3         721      2045.53    1.093068      VIP
4338        18287            42          70      1837.28    0.902947     Gold

[4339 rows x 6 columns]

In [260]:
# 등급 별 회원 명수 확인 
new_df['Level'].value_counts()

Level
Gold       1518
Silver     1085
Diamond     868
Bronze      651
VIP         217
Name: count, dtype: int64

In [267]:
new_df['Location'] = ci_df.groupby(['Customer_ID', 'Country']).value_counts().reset_index()['Country']

#### 주문 지역 확인

💡 해결 방법?
1. unitprice(0.00), quantity(0, 음수) 이상치 제거
2. 결측치 확인
3. 결측치 값 채우고> 그래도 빈 거 제거

In [263]:
# Customer_ID 타입 변경
# 타입 확인
ci_df['Customer_ID'].dtype

# 소숫점 첫째자리가 0이 아닌 값을 출력하기
# for id in ci_df['Customer_ID']:
#    if int(id*10) % 10 != 0:
#        print('ㅎㅎ')
#    else:
#        print('낑')

dtype('int32')